''' 4й урок
    вывод списков
'''
# ----- 2 -----------------------------------------

user_list = [2, 4, 1, 7, 5, 8, 23, 15, 9]
new_list = [ela for c, ela in enumerate(user_list) if (c == 0 or ela > user_list[c - 1])]
print(new_list)

# ----- -----------------------------------------

# ----- 3 ---------------------------------------

print([el for el in range(20, 240) if (not el % 20) or not (el % 21)])

# тут думаю чть NOT уместнее чем == 0 так как короче.

#  ----- -----------------------------------------


# ---- 4 ------------------------------------------
user_list = [20, 2, 7, 4, 1, 4, 7, 15, 2, 5, 2, 8, 1, 23, 15, 9]
new_set = set(user_list)
print(new_set)
# как бы и все. задача " Определить элементы списка, не имеющие повторений. Сформировать итоговый массив чисел,
# соответствующих требованию." - решена. Куда тут генератор прикрутить не понял.

# ----------------------------------------------


# -- 5 --------------------------------------------
from functools import reduce


def mnoj(prev_el, el):
    return prev_el * el


my_list = [el for el in range(100, 1001)]
print(reduce(mnoj, my_list))
# ----------------------------------------------


# --- 6 -------------------------------------------
from itertools import count, cycle

it_start = int(input("Введите начальный номер для генератора : "))
user_list = ['2q', '4w', '1e', 7, '5g', '8r', 23, '15t', 9]
ii = 0

for el in count(it_start):
    if el > 40:
        break
    else:
        print(el)

print(' -------------------------------------------------- ')
print(' -------------------------------------------------- ')

for el in cycle(user_list):
    if ii > 40:
        break
    else:
        print(el)
        ii += 1
# ----------------------------------------------


# --- 7 -------------------------------------------
from math import factorial

def fi_gen(numm):   # генератор для факта
    mylist = range(numm+1)
    for i in mylist:
        yield i


for el in fi_gen(15):
    print(el, '  ', factorial(el))
